
create database football;
use football;

CREATE TABLE IF NOT EXISTS `player` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(30) DEFAULT NULL,
  `surname` varchar(30) DEFAULT NULL,
  `age` int(11) DEFAULT NULL,
  `country` varchar(30) DEFAULT NULL,
  `avg_goal` double(3,2) DEFAULT NULL,
  `count_goal` int(11) DEFAULT NULL,
  `count_match` int(11) DEFAULT NULL,
  `club` varchar(30) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=22 ;

--
-- Дамп данных таблицы `player`
--

INSERT INTO `player` (`id`, `name`, `surname`, `age`, `country`, `avg_goal`, `count_goal`, `count_match`, `club`) VALUES
(1, 'Ліонель', 'Мессі', 32, 'Аргентина', 1.08, 465, 432, 'Барселона'),
(2, 'Кріштіану', 'Роналду', 34, 'Португалія', 1.30, 558, 429, 'Ювентус'),
(3, 'Гуннар', 'Нордаль', 41, 'Україна', 0.95, 399, 421, 'Динамо'),
(4, 'Андрій', 'Шевченко', 38, 'Україна', 0.85, 401, 473, 'Динамо'),
(5, 'Антон', 'Аршавін', 31, 'Росія', 0.84, 312, 371, 'Спартак'),
(6, 'Джордан', 'Ларсонн', 27, 'Росія', 0.50, 113, 228, 'Спартак'),
(7, 'Андре', 'Шюррле', 24, 'Росія', 0.48, 94, 197, 'Спартак'),
(8, 'Віктор', 'Циганков', 22, 'Україна', 0.34, 33, 97, 'Динамо'),
(9, 'Денис', 'Бойко', 25, 'Україна', 0.36, 43, 119, 'Динамо'),
(10, 'Жерсон', 'Родрігес', 24, 'Португалія', 0.45, 78, 173, 'Динамо'),
(11, 'Микола ', 'Шапаренко', 21, 'Україна', 0.64, 21, 33, 'Динамо'),
(12, 'Йосип', 'Пиварич', 30, 'Хорватія', 0.74, 100, 136, 'Динамо'),
(13, 'Артем ', 'Шабанов', 27, 'Україна', 0.67, 109, 163, 'Динамо'),
(14, 'Антуан', 'Грізман', 28, 'Франція', 0.45, 119, 263, 'Барселона'),
(15, 'Артур', 'Відаль', 32, 'Чілі', 0.51, 93, 184, 'Барселона'),
(16, 'Іван', 'Ракитич', 31, 'Швейцарія', 0.59, 169, 287, 'Барселона'),
(17, 'Рональд ', 'Арахуо', 20, 'Уругвай', 0.32, 10, 31, 'Барселона'),
(18, 'Мейсон', 'Маунт', 21, 'Великобританія', 0.38, 26, 69, 'Челсі'),
(19, 'Фікайо', 'Томорі', 22, 'Канада', 0.44, 41, 93, 'Челсі'),
(20, 'Олів''є', 'Жиру', 33, 'Франція', 0.41, 94, 231, 'Челсі'),
(21, 'Емерсон', 'Палмері', 25, 'Бразилія', 0.40, 34, 84, 'Челсі');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
